---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LayerElemOffsetFromHost
source: html/d77488e9-92b8-9139-ad96-e4c27665af20.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LayerElemOffsetFromHost Property

"Offset From Host"

## Syntax (C#)
```csharp
public static ForgeTypeId LayerElemOffsetFromHost { get; }
```